install.html
<!DOCTYPE html>
<html>
  <head>
  <meta charset="utf-8">
  <meta name="apple-mobile-web-app-capable" content="yes">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <title>Installation</title>

  <meta name="description" content="installation and configuration for perry">
  <meta name="keywords" content="{% if page.keywords %}blog, static site, elisp, Emacs{% else %}blog, static site, elisp, Emacs{% endif %}">

  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">

  
  <link rel="stylesheet" href="https://qwxlea.github.io/perry.el//css/main.css">
  <link rel="stylesheet" href="https://qwxlea.github.io/perry.el//css/font-awesome.min.css">

  <link rel="canonical" href="posts/install.html">
    <link rel="alternate" type="application/rss+xml" title="Perry Documentation" href="https://qwxlea.github.io/perry.el//feed.xml">

</head>

  <body>
    <main class="wrapper">
    <header class="site-header">
  <nav class="nav">
    <div class="container">
      <h1 class="logo">
        <a href="/">
        Perry Documentation
        </a>
      </h1>
      <ul class="navbar">
        <li>
  <a class="menu-item active"
    href="/install.html"  title="">
    Installation</a>
</li>

      </ul>
    </div>
  </nav>
</header>

    <div class="container">
      
<div id="outline-container-orge3d3466" class="outline-2">
<h2 id="orge3d3466">Installation</h2>
<div class="outline-text-2" id="text-orge3d3466">
<p>
For now, copy or git clone the repository:
</p>

<div class="org-src-container">
<pre class="src src-shell">% git clone https://github.com/QWxleA/perry.git
</pre>
</div>

<p>
Then add <code>perry</code> to your load-path:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8c8c8c;">(</span>add-to-list 'load-path <span style="color: #ff00ff;">"~/Projects/perry.el"</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Start perry with <code>perry-manager</code>
</p>
</div>
</div>

<div id="outline-container-org89371c1" class="outline-2">
<h2 id="org89371c1">Configuration</h2>
<div class="outline-text-2" id="text-org89371c1">
<p>
An example configuration can be found in perry.el
</p>

<p>
Add your own configuration to <code>perry--rc</code>
</p>
</div>
</div>

<div id="outline-container-orge0c244c" class="outline-2">
<h2 id="orge0c244c">Important</h2>
<div class="outline-text-2" id="text-orge0c244c">
<p>
Perry has not even reached alpha-quality yet, don't use this for anything useful!
</p>
</div>
</div>

      <footer class="site-footer">
  <div class="container">
    <small class="block">&copy; 2017 Alex &#39;QWxleA&#39; Poslavsky. All rights reserved.</small>
    <small class="block">Made with <i class="fa fa-heart" aria-hidden="true" style="color:#DD3D36"></i> using <a href="https://github.com/QWxleA/perry.el">Perry.el</a>. Typeface by <a href="https://fonts.google.com/specimen/Inconsolata">Inconsolata</a> and <a href="http://fontawesome.io/">Font Awesome</a>.</small>
    <small><a href="https://github.com/heiswayi/thinkspace">Thinkspace</a> theme by <a href="http://heiswayi.github.io/">Heiswayi Nrird</a>.</small>
  </div>
</footer>

    </div>
    </main>
  </body>
</html>
